MirikoHi/ec2026/robot.syscfg
TIMER3.$name              = "ZDT_MOTOR_TICK";
TIMER3.timerClkPrescale   = 10;
TIMER3.timerMode          = "PERIODIC";
TIMER3.timerPeriod        = "0.3 ms";
TIMER3.timerStartTimer    = true;
TIMER3.interrupts         = ["ZERO"];
TIMER3.peripheral.$assign = "TIMG6";

UART1.enabledInterrupts                = ["RX"];
UART1.interruptPriority                = "0";
UART1.$name                            = "UART_1";
UART1.targetBaudRate                   = 115200;
UART1.peripheral.$assign               = "UART1";
UART1.peripheral.rxPin.$assign         = "PB7";
UART1.peripheral.txPin.$assign         = "PB6";
UART1.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART1.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0";
UART1.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART1.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART1.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART1.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1";

UART2.$name                            = "UART_0";
UART2.enabledInterrupts                = ["RX"];
UART2.targetBaudRate                   = 115200;
UART2.peripheral.rxPin.$assign         = "PB13";
UART2.peripheral.txPin.$assign         = "PB12";
UART2.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric11";
UART2.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART2.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART2.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric12";
UART2.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART2.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART2.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");

UART3.$name                            = "K230";
UART3.enabledInterrupts                = ["RX"];
UART3.targetBaudRate                   = 115200;
UART3.peripheral.$assign               = "UART2";
UART3.peripheral.rxPin.$assign         = "PB16";
UART3.peripheral.txPin.$assign         = "PB15";
UART3.txPinConfig.direction            = scripting.forceWrite("OUTPUT");
UART3.txPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.txPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.txPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.txPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric15";
UART3.rxPinConfig.hideOutputInversion  = scripting.forceWrite(false);
UART3.rxPinConfig.onlyInternalResistor = scripting.forceWrite(false);
UART3.rxPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
UART3.rxPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric16";

ProjectConfig.genDisable      = true;
ProjectConfig.switchCondition = true;
scripting.suppress("Project Configuration File generation is disabled for this project\\. SysConfig Project Migration is not currently supported for this project\\.", ProjectConfig);

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
pinFunction4.peripheral.$suggestSolution           = "SYSCTL";
pinFunction4.peripheral.hfxInPin.$suggestSolution  = "PA5";
pinFunction4.peripheral.hfxOutPin.$suggestSolution = "PA6";
Board.peripheral.$suggestSolution                  = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution         = "PA20";
Board.peripheral.swdioPin.$suggestSolution         = "PA19";
GPIO1.associatedPins[0].pin.$suggestSolution       = "PA14";
GPIO2.associatedPins[0].pin.$suggestSolution       = "PA30";
GPIO2.associatedPins[1].pin.$suggestSolution       = "PA31";
GPIO2.associatedPins[2].pin.$suggestSolution       = "PB0";
GPIO2.associatedPins[3].pin.$suggestSolution       = "PB1";
GPIO3.associatedPins[0].pin.$suggestSolution       = "PA7";
GPIO3.associatedPins[1].pin.$suggestSolution       = "PA21";
GPIO3.associatedPins[2].pin.$suggestSolution       = "PA18";
GPIO3.associatedPins[3].pin.$suggestSolution       = "PB14";
GPIO4.associatedPins[0].pin.$suggestSolution       = "PB2";
GPIO4.associatedPins[1].pin.$suggestSolution       = "PB3";
GPIO4.associatedPins[2].pin.$suggestSolution       = "PB18";
GPIO4.associatedPins[3].pin.$suggestSolution       = "PB19";
GPIO5.associatedPins[0].pin.$suggestSolution       = "PA29";
GPIO6.associatedPins[0].pin.$suggestSolution       = "PA15";
GPIO6.associatedPins[1].pin.$suggestSolution       = "PA8";
GPIO6.associatedPins[2].pin.$suggestSolution       = "PA17";
GPIO6.associatedPins[3].pin.$suggestSolution       = "PA9";
GPIO8.associatedPins[0].pin.$suggestSolution       = "PA24";
GPIO8.associatedPins[1].pin.$suggestSolution       = "PB25";
GPIO8.associatedPins[2].pin.$suggestSolution       = "PB24";
I2C1.peripheral.sdaPin.$suggestSolution            = "PA10";
I2C1.peripheral.sclPin.$suggestSolution            = "PA11";
MCAN1.peripheral.$suggestSolution                  = "CANFD0";
MCAN1.peripheral.rxPin.$suggestSolution            = "PA13";
MCAN1.peripheral.txPin.$suggestSolution            = "PA12";
SPI1.peripheral.$suggestSolution                   = "SPI1";
SPI1.peripheral.cs0Pin.$suggestSolution            = "PA2";
UART2.peripheral.$suggestSolution                  = "UART3";
